{"meta":{"title":"不只是卖萌君","subtitle":"因着这束光，我便能把黑夜变成白天","description":null,"author":"Echo","url":"https://echotsai.github.io"},"pages":[{"title":"","date":"2017-05-24T15:40:38.000Z","updated":"2017-05-24T15:40:38.000Z","comments":true,"path":"about/index.html","permalink":"https://echotsai.github.io/about/index.html","excerpt":"","text":".clearfix:after { content: \"\"; display: block; clear: both; } 关于我 角色：卖萌君 种族：吃货星人 身份：爱学编程的产品🐶 性格：乐观 温和 行动力强 技能：驯服程序猿+快速学习 长相特征：头发乌黑顺滑 所属公会：产品骑士 常年潜伏地：程序猿的领土 梦想：周游列国 喜欢：挑战性的任务 讨厌：辣椒和海鲜 喜欢的食物：饭团🍙 星座：太阳射手座 上升星座：处女座 座右铭 当你真心渴望追求某种事物的话，整个宇宙都会联合起来帮你完成。"}],"posts":[{"title":"关于慢病管理产品的思考","slug":"0522_3","date":"2017-04-01T14:28:58.000Z","updated":"2017-05-24T10:05:21.000Z","comments":true,"path":"2017/04/01/0522_3/","link":"","permalink":"https://echotsai.github.io/2017/04/01/0522_3/","excerpt":"","text":"近期公司在和医疗智能硬件公司谈合作，想要把当前现有的病患、医生、医院和药店资源结合智能硬件商，做完整的行业解决方案。 我相信这已然是行业里的一个大趋势，通过运用医疗数据、行为数据、人群画像、风险数据，为用户的健康管理制定方案和提供依据。具体到产品上来说，即根据患者身体情况和疾病程度、历史产品使用记录服务的次数和效果、产生效果的人数等数据，逐步建立起数据模型，通过数据分析做出有针对性的健康管理建议。 于是，我对此做了一些需求的分析和功能逻辑的梳理： 同时，也针对慢病管理的个人版和医生版梳理了初步的功能规划脑图，因为脑图过大无法完整在这里展示，截图一小部分，完整版本可以点击 这里 查看。 未作展开的药店版因为要结合已经完成的版本，因此还没来得及完善；管理后台，需要根据客户端的功能来确定最终需求，也还没有具体展开；微信版只是用户版客户端的另一种呈现方式，很可能又少无多，所以没有过多展开。","categories":[{"name":"产品养成记","slug":"产品养成记","permalink":"https://echotsai.github.io/categories/产品养成记/"}],"tags":[{"name":"医疗","slug":"医疗","permalink":"https://echotsai.github.io/tags/医疗/"}]},{"title":"参加创客比赛的第一桶金","slug":"第三篇文章","date":"2016-09-20T15:58:58.000Z","updated":"2017-05-24T10:39:54.000Z","comments":true,"path":"2016/09/20/第三篇文章/","link":"","permalink":"https://echotsai.github.io/2016/09/20/第三篇文章/","excerpt":"","text":"赛前准备看过太多的创客，从未想过自己也会成为之一一直到2015年的夏天，报名参加了广州第二届创客马拉松参赛的我们有2名从未做过app的前端开发，1名设计师和1名“产品”（我）比赛的前1天，我还在否定自己无法胜任团队里的产品设计毕竟我当时连最基础的Axure还不会用，只会简单的手绘我自认为这样的组合，想拿奖是极其不容易的 关于比赛活动详情：点击查看官方报道大赛主题：围绕“智慧城市”和“开放数据”进行开发以改善城市开发时间：共48小时，从6月5号下午到6月7号下午比赛方式：6月7日下午交付作品demo，各团队做演讲展示作品评选方式：评委老师协商，选出前三名和单项奖并颁奖奖金设置：一等奖2万元奖金，单项奖5000元奖金现场评委：胡晓老师和几位投资人 确定作品主题比赛当天，我们提前下班搭地铁前往现场因为电脑不够用，谁会想到我们把公司的iMac搬到了现场 6月5日下午赶到现场的我们，从安顿好后开始讨论直到当天晚上7点，脑暴中的我们还毫无头绪，各种想法被一个个否定眼看时间已经逼近8点，48小时已经过去了6个小时我们没有继续犹豫不定，敲定了就做“餐饮界的优步”APP这个点子一共包括用户和商家两个角色，DEMO演示将重点放在用户版 分工非常明确，我负责手绘原型图设计师先行收集相关素材两位前端做前期准备毕竟他们从来做过app -作品实现-因为与平时的工作有别，所以我们对进度的把控地更为紧凑次日上午（6月6日），大家集体过了一遍我前一天晚上完成的初稿确定了需要修改的细节和基本方向没有问题 当天基本是流水线式作业我一页页地移交设计师敲定的原型稿设计师一页页地移交前端确定的设计稿1位前端负责设计稿的UI处理1位前端负责测试服务器的搭建和百度地图等难点完成主要功能的原型稿后，我开始做演示用的PPT设计师则在完成设计稿后，开始对PPT进行润色 当天晚上demo就完成得七七八八了剩下细节的优化、PPT、次日演示的demo设备调试 其实当天输出的手绘原型图略为粗糙，更多的是与设计师的频繁沟通因为合作默契，设计师的还原度和demo的还原度都非常高除了功能的实现和还原，APP两个端的命名、slogan等细节我们都以非常高效的方式达成了一致 原型草稿图：最终的成品： 作品展示比赛的最后一天，6月7日上午PPT的润色还在进行，我紧张地准备演讲稿两位前端们也紧张地准备着demo的演示设备 上台演示的顺序是抽签决定的，我们运气很好比较靠后下午2点左右，我们的作品也按时提交了全组四人都要登场，demo连接展示电视PPT投影到大屏幕，作品的主讲人是我，队友们帮助应对评委的提问 一切就绪后，第一组选手就开始上台展示作品了坐在台下的我们四个都边听边对比着自己的作品我们的大前端是两个男生，表面一点不紧张结果我练稿回来，竟然发现有一个boy紧张到手机摔碎了屏(╯﹏╰) 现场有20多个参赛团队，四位评委老师，100多人的样子终于到了我们组，我极力克制着紧张把产品演示完成队友们配合把手机demo拿给各位评委老师展示评委老师问了几个非常棘手的问题，我们也一一击破了作品展示终于告一段落，我们都长舒口气比赛竞争很激烈，现场也有很多优秀的作品我们不确定第一次参赛，能否拿到名次 赛事结果和颁奖晚上晚饭结束后，终于到了宣布结果的时候评委老师和投资人不紧不慢地报着获奖团队的名字三等奖有几名分别是xx团队、二等奖有几名分别是xx团队…听了很久都没听到自己的名字，我们四个人突然有点灰心 就在我们都不再抱什么希望的时候，出奇地听到了自己的队名“获得一等奖的团队是：Eater的作品！”“获得最佳商业价值奖同样是：Eater团队”压抑了太久的忐忑和不安瞬间转化成了爆发式的欢呼我们激动地欢呼抱在了一起，上台领取了奖状 获奖作品介绍所获奖项：一等奖 最具商业价值奖作品名称：Eater作品介绍：蹭饭 App是一款家常菜共享的App，主要解决上班族午饭问题，对于蹭饭用户而言，可上自取或者通过小区内的物流配送，从而实现地道家常菜的吃饭需求；对于在家做饭的阿姨们来说，在平日只给自己家做饭的同时还顺带获得额外收入，闲暇的劳动时间和精力被赋予经济价值。(点击可查看官方报道) PS：当时比较新鲜的创意，现在市场上已经有很多类似产品了比如“回家吃饭”。所以创意固然可贵，然而付诸行动才是最快而有效的实践方式。","categories":[{"name":"产品养成记","slug":"产品养成记","permalink":"https://echotsai.github.io/categories/产品养成记/"}],"tags":[{"name":"创客马拉松","slug":"创客马拉松","permalink":"https://echotsai.github.io/tags/创客马拉松/"}]},{"title":"复盘回顾从0到1的项目经历","slug":"0522_2","date":"2016-09-15T15:58:58.000Z","updated":"2017-05-24T12:39:58.000Z","comments":true,"path":"2016/09/15/0522_2/","link":"","permalink":"https://echotsai.github.io/2016/09/15/0522_2/","excerpt":"","text":"团队搭建和项目起步15年9月我加入了一个全新的团队当时团队的定位是要做O2O行业的第二个爱鲜蜂我作为第三个加入的早期成员真正体会了一次项目从0到1的发展 前期团队人数一直保持在10人左右，基本都是1个人干几个人的活儿。当时的人员配置相对精简，一些岗位尽量能省则省配置大概如下： 产品2人，兼顾项目管理、测试和应用发布等工作 设计1人，负责全部的UI设计和平面设计工作 运营3人，负责产品运营、市场运营和客服工作 客户端3人，iOS开发1人+安卓开发2人 后台3人，兼顾运维工作 初期个人成长我在团队里的角色是双向的一方面是产品策划，一方面是项目管理 团队新成员的磨合进度非常快9月底项目便开始进入正轨产品开始陆续进入开发 因为是初创团队，繁杂的事物就特别多各种开发账号、企业认证手续特别复杂企业认证和支付的事情本该是财务负责但是因为财务实在是一窍不通一头雾水为了加快日程进度我就索性一手负责了 这些工作很简单，却格外消耗一个人的耐心和精力，包括：阿里云服务器的认证，各种第三方平台的账号申请和认证：不限于苹果开发者账号、安卓各大市场注册认证、支付宝企业账号、微信企业账号、ping++企业账号、友盟、极光推送、融云sdk、mob sdk等等，对APP进行各大平台的发布上架 不过处理这些琐事，也让我更快了解了的我，为了提高效率，很快找到了规律并形成了一套方法各种认证需要的资料基本大同小异，各大应用市场的发布流程也万变不离其宗APP发版流程：点击可查看笔记APP上架应用市场注意事项：点击可查看笔记 此外，我还快速学会了项目管理的甘特图、Q&amp;A项目跟进表/日程图，并很好地加以运用。借助这些工具，我对项目接下来的发展起到了可见性的推动作用。日程图：Q&amp;A表：甘特图： 项目发展在大家的共同努力下，发展业务发展态势良好业务线也有所增加，在原来的O2O生活服务平台基础上，新增了移动支付业务 于是团队迅速进行了人员的扩充，扩充后的配置如下：产品4人，设计3人，产品运营3人，客户端6人，后台10人，前端3人，测试3人，运维1人，商务2人，客服2人，市场运营人员10+ 我对这段发展经历，做了一个简单的梳理： 瓶颈和突破身兼数职的我，因为繁重的产品策划和项目管理工作，被压得喘不过气 项目成果经过团队不断地磨合和调整，两条业务线都取得了一定的成绩如下并获得了新一轮的融资，成绩如下： O2O生活服务平台：产品自2016年1月上线，用户量从0增长到24万+，引进商家3000+，峰值日订单量8w+，总流水200余万+ 移动支付业务：产品自2016年10月上线，用户量从0增长到10万+，入驻商户5000+，累计流水2000万+ 然而在得知A轮融资完成后的11月，大家因为小有收获的喜悦被掠夺一空投资公司并没有兑现诺言，公司不得以融资失败的结果进行裁员作为早期成员的我，因为给团队创造了很多价值而得以留了下来第一次面临资本寒冬下的大裁员，我深深体会到了当中的痛苦在离开之际，我还是坚持把手上的工作做了详尽的整理和交接 回想起和队友们并肩作战的日子，内心百感交集眼前，突然浮现出程序员们凌晨4点的夜改完bug的喜悦仿佛又看到评审会上，大家为了一个小功能而争辩得面红耳赤我隐约又听到了管理例会上，部门负责人关于未来的激昂讨论创业是一群人的狂欢，即便经历了失败也不足以被其打败我相信，很快每个人都会走出悲伤为成为更好的自己而加倍努力fighting！","categories":[{"name":"产品养成记","slug":"产品养成记","permalink":"https://echotsai.github.io/categories/产品养成记/"}],"tags":[{"name":"项目管理  流程优化  甘特图","slug":"项目管理-流程优化-甘特图","permalink":"https://echotsai.github.io/tags/项目管理-流程优化-甘特图/"}]},{"title":"我的第一篇博客","slug":"hello-world","date":"2016-01-15T15:58:58.000Z","updated":"2017-05-24T10:09:03.000Z","comments":true,"path":"2016/01/15/hello-world/","link":"","permalink":"https://echotsai.github.io/2016/01/15/hello-world/","excerpt":"","text":"初次接触博客拖延了这么久，终于用hexo的框架搭好了自己的博客看了一圈儿别人的酷炫博客，感觉自己像在一个茅房里码字吓得我赶紧去搬了几块砖，结果砖头样式太多，把自己看花了眼貌美如花的个人博客多到没朋友，我就直接搬过来慢慢挑了： 酷炫吊炸天：立体世界-Maxodgen哥动感摇摆-第5维度™工作室一直会自己动的代码对话-strml.net实时记录-动态齿轮 深藏功与名：走遍全球游记哥-翁天信 · Dandy Weng 黑白灰性冷淡：印刷店既视感故事型展开-黑加白水墨画游记-分分钟成仙 纯技术最简风：技术博客-于江水 新概念英语风格：Rafal Tomal BEC商务英语既视感：EVANYOU 暂时先更这么多吧，毕竟外貌不是最重要的。[引自]你见过的最棒的个人博客界面是什么样的？ 博客风格替换兜了一圈儿，才猛然发现原来hexo有现成的theme没文化真可怕，明明官网theme的入口显眼得很：https://hexo.io/themes/果然还没适应过来程序员的世界，总是容易忽略文档这回终于记得了，选好theme后就乖乖看起了文档markdown语法还不是很熟悉，所以临摹了一段文档（标题小了1个尺寸） Installation 123456# change to work dircd /your_blog_dir/# install dependenciesnpm i -S hexo-generator-search hexo-generator-feed hexo-renderer-less hexo-autoprefixer hexo-generator-json-content# download sourcegit clone https://github.com/stkevintan/hexo-theme-material-flow themes/material-flow Configuration Change the value of theme to material-flow in _config.yml. Put your avatar &amp;&amp; favicon images to source/images/. Edit _config.yml and themes/material-flow/_config.yml for your needs. Here are some examples: _config.yml themes/material-flow/_config.yml","categories":[{"name":"从零学编程","slug":"从零学编程","permalink":"https://echotsai.github.io/categories/从零学编程/"}],"tags":[{"name":"markdown","slug":"markdown","permalink":"https://echotsai.github.io/tags/markdown/"}]}]}