{"meta":{"title":"不只是卖萌君","subtitle":"因着这束光，我便能把黑夜变成白天","description":null,"author":"Echo","url":"https://echotsai.github.io"},"pages":[{"title":"","date":"2017-05-24T15:40:38.000Z","updated":"2017-05-24T15:40:38.000Z","comments":true,"path":"about/index.html","permalink":"https://echotsai.github.io/about/index.html","excerpt":"","text":".clearfix:after { content: \"\"; display: block; clear: both; } 关于我 角色：卖萌君 种族：吃货星人 身份：爱学编程的产品🐶 性格：乐观 温和 行动力强 技能：驯服程序猿+快速学习 长相特征：头发乌黑顺滑 所属公会：产品骑士 常年潜伏地：程序猿的领土 梦想：周游列国 喜欢：挑战性的任务 讨厌：辣椒和海鲜 喜欢的食物：饭团🍙 星座：太阳射手座 上升星座：处女座 座右铭 当你真心渴望追求某种事物的话，整个宇宙都会联合起来帮你完成。"}],"posts":[{"title":"加州的谷歌生活","slug":" 谷歌学习","date":"2017-05-26T03:46:00.000Z","updated":"2017-05-26T07:43:05.000Z","comments":true,"path":"2017/05/26/ 谷歌学习/","link":"","permalink":"https://echotsai.github.io/2017/05/26/ 谷歌学习/","excerpt":"","text":"最近认识了一个新朋友ta给我带来了很多新的认知作为一个爱学习的好奇宝宝没来得及压抑自己的天性忍不住问了很多有趣琐事主要还是围绕未来核心竞争力的话题好了，我们的对话马上展开(＾－＾)V 第一次谈谷歌生活 在谷歌工作是一种怎样的体验 ？舒服自在的体验，每个人都做好自己的事，管好自己的生活 你是在加州工作吗?(硅谷的山景城)是的 作为谷歌的产品，不知道你的一天是怎么度过的？跟着师傅学习，你可以理解为徒弟大部分工作自己做，小部分咨询老师 不知道你说的的大部分工作一般是什么呢？大公司比较细，做的东西可能就一个图标，你可以这样理解人太多，所以大材小用不过考核的时候要什么都懂，避免尴尬实际操作中并不难 如果面对一个不熟悉的行业，你一般会通过哪些方式去了解？社会上很多人身不由己，大多是为了赚钱而工作并非出于兴趣一些不熟悉的行业，我个人在大学的时候（清华）想过从事很多职业，比如科学家、艺术家可是现实还是很残酷的，家里人肯定希望你能过得好 不知道你指的是哪方面的艺术家？画画、音乐都可以，我后天学的出于兴趣的话，你可以加入一些行业社团里面很多人会有讲座，之前清华大学五道口就是中国谷歌的总部，我经常去里面看看我觉得其实这个公司也挺不错的，又能赚钱 首先要看书，看一些比如互联网的书或者你要从事的行业的书不过要辩证的态度去看待看感兴趣的书就行了，我喜欢看我喜欢的东西 你现在的主要工作是什么？我现在主要是写一些代码和一些硬件漏洞的研究我这个人情世故的比较少，可以自己做研究 如果想找到合适的工作，首先你要找到自己喜欢的东西才能进一步去发展 对于找工作和面试你有什么建议吗？大公司都可以去尝试一下，先要把自己的目标选好其次是简历的润色，我们这一行需要作品作品就是名片，可以把作品写在自己的私人博客这样满满的加分，你可以慢慢学不要着急 搜索东西的话，我建议你使用Google让你的博客能够出现在搜索引擎里这个也对你有帮助 你不需要太过紧张，笔试面试正常发挥好好的表现自己，把你能够为公司创造的价值告诉他们他们应该会录取你的 谷歌总部在国内没有直接的招聘，只能自己去官网投递简历我有幸被挑中了简历，后面去了美国面最后一次报销了机票和种种，这是我第一次去美国所以还是要有梦想的~说不定实现了呢 你一个人在美国生活，会不会孤单？偶尔会，不过三番市有清华同学会，我们聚聚也还好 刚才你提到搜索用谷歌，有什么翻墙软件推荐吗？Surge这个软件开发的很好哦，是收费的 你平时上班的主要交通方式是什么？我们有班车，偶尔我自己开车在加州，需要驾照做身份证美国没有身份证一说，我不能天天拿着护照 国内的护照那边认可吗国内护照其实不认可，需要重新考一下很简单的，我考的是美国加州驾照，全美通用美国每个州的考试不一样，非本州最好还是换一下比较好 在加州的伙食和住宿是怎样的？开销大吗公司提供伙食，吃饭不用花钱（害羞脸.jpg)住宿自己解决，我住的地方离公司不远搭班车的话一般20分钟左右，自己开车也快，公路不收费哦住宿是租的房子，普通的两室一厅，月租2000美金 那边的物价水平是怎样的呢？工作水平和不成正比，中国人民币要和美金一比一考虑美国没有外卖，你可以理解成深圳外卖30块，这边就是30美金有机会的话，你也可以来国外发展 飞美国的机票一般是什么价位？平常的话，单程5000块左右如果提前买的话，估计能来回我一般是在票务官网买，这样比较安心 在谷歌工作的一天 你在工作日的一天是怎么度过的？开会，讨论，去实验室，一般是这样中间有一段时间可以休息一下 可以从起床时间开始说起吗：）我五点起床，去锻炼跑步，然后洗漱，坐车去公司吃早餐周一二四五早上开例会，随后和底下工程师讨论下设计概念看情况去实验室和科学家学习东西，休息时间可以看书打游戏 周三休息吗？周三不开会而已，有别的事情，要听上面安排 例会是从上班时间就开始开吗？恩，这算团队协作，每个部门不一样这是我老板这样安排的，其实并不轻松 你们的上班时间是固定的吗？需要打卡吗？是的，上班固定的，不需要打卡可以迟到，不过错过了讨论就是对自己的损失 山景城的日出时间是上午5：53分，5点就起床会不会天很黑？不会很黑的，我一般都是这个点起来，讨论是10:00开始差不多7点到公司，早点到把前一天剩下来的工作尽量做完 休息时间是在什么时间段呢？除了团体活动，随时可以休息休息有代价，就是工作会堆积一般没什么事就不休息中午会午休，不过有时也不睡（有临时性的休息室）没人找你讨论的话就可以休息 下班时间呢？最早几点可以离开四点多就可以走了，不过一般我会七点多有时候6点多，不一定，有时候天黑了就吃完饭回去 你一般都吃什么？面条、汉堡、牛排、咖喱沙拉等等我会做饭，不过很少做 你五点起床的习惯是什么时候开始有的？读书的时候，一直都这样，当时是跑操场学英语、背课文，边跑步边记忆 昨天你提到的实验室和科学家是一种怎样的存在？就是专门做研究的，大公司都有像你说的没错，实验室相当于测试产品的地方科学家研究的课题我不大清楚，但是可以沟通我们主要研究神经网络的算法，以数学和计算机算法为主 加州的夜和枪 加州有夜生活吗？应该有，不过我晚上基本不出去我这里是美国西部时间，每天往西就能看到祖国现在已经晚上11点了（中国：次日下午2点）晚上不大安全，美国人家里都有手枪 是不是没有手枪，没什么安全感？（笑）我考了合法持枪证，美国有枪支协会手枪我花2000块买了一个BPCC 380ACP不过我不随身带，放在家里防贼用或者晚上出门带着，白天基本不需要 国内的话，只有警察能合法持枪这里虽然可以持枪，但是也只能自卫属于自卫的情况其实有很多限制一般指当你受到生命危险的时候 你的枕头下就是枪吗？我从枕头下掏出的是手机，你掏出的是枪（笑）（笑而不语）枪是有保险扣的，不会走火枪是有锁的，扣动扳机，就是开锁当过兵的都用过枪，没有当过有射击场可以学习 第一次开枪是什么感受？会手抖吗？手不抖，和打气球的枪一个感觉（调皮.jpg） 工作生活碎碎念 你和同事平时都聊些什么呢？都可以聊，聊得开心就好从天上到地下，从哲学到物理都可以聊反正懂一点，聊文学都行国外的英语很简单，你待一段时间就会了，能工作就行 你下班回家后一般都做些什么？洗澡、打游戏、看新闻 你平时喜欢看些什么书？含杂，什么都看，喜欢看传记 传记，有特别推荐的吗？（不局限于传记）杨绛《我们仨》、金庸小说、《三体》、《地球往事》《超新星纪元》、《北京折叠》、《哈利波特》《沉默的告白》、余华的《活着》《兄弟》《第七天》这些都挺不错的，我觉得挺好看，其实我最喜欢的是历史类的书籍如果实在不爱看书的话，业余可以打打游戏放松一下 你之前提到每天都会跑步，下雨天呢？下雨天也可以去跑步的，不要紧穿雨衣就行了，我有很多一次性的雨衣我就穿普通的NB，这里的路挺好的，一般不会滑倒 你们那里有雨季吗？这里没有雨季，和北京的维度差不多海洋季风气候，四季分明，对湾区不冷不热 有计划买房子吗？那边房价怎么样？50万美金就可以住的很好，国外工资高拿到绿卡后就可以买，满两年多就能拿绿卡 50万美金是永久产权吗？是的，和国内不同，国内买房相当于租了70年 日常出行的主要方式是什么？基本上要自己开车，美国公共交通不发达 你是怎么学习语言的？会背些单词，大部分还要看剧边看边听边记忆，会说和会听的懂就行不会写没事的，语言本来是用来交流的，文字只是手段很多人学不会英语，就是因为他们不注重交流 一本正经提问题 你日常使用的工具和软件？常用软件，我建议你用：axure rp，XMind，sketch，xcode外加一个：github偶尔也会用用office系列：Excel，Onenote，ppt，Outlook，Word还有PS，BR（Adobe Bridge CS6），Android Studio这个也可以做样本，流程图之类的东西：Justinmind 软件很多，你要熟练应用其实一个xcode就能打遍天下无敌手 对于一个马上要面试的产品，你会给出什么建议帮助ta？如果你会编程语言的话，去面试一定会通过的我给你面试的建议是先学一些简单的语言比如PythonPython很简单，国内都有教程，可以先买本书然后可以再学点命令行、Shell语言 比如你要做知识图谱方面的产品，你就要会Excel和Axure产品经理分好多方向，开发App就是另外一个方向了你可以先把这些软件学习起来，找一个软件专门学推荐你学Axure，XMind，Xcode（学精） 比如App最好的产品经理是自己开发出来App实现基本功能，能初步使用用xcode做或者Android Sdutio能发现bug交流起来就方便了，他们也不会打马虎眼了你什么都不懂的话，他们不会服气的 谷歌是个工程师文化的公司，产品经理都必须是个工程师所以我也可以独立开发东西 其实公司里就是用这些软件，无非是电脑换成了公司的而已学习软件的过程，要看教程再学学，节约时间成本最好看英文的教程 未完待遇…","categories":[{"name":"产品养成记","slug":"产品养成记","permalink":"https://echotsai.github.io/categories/产品养成记/"}],"tags":[{"name":"谷歌 未来核心竞争力","slug":"谷歌-未来核心竞争力","permalink":"https://echotsai.github.io/tags/谷歌-未来核心竞争力/"}]},{"title":"关于慢病管理产品的思考","slug":"0522_3","date":"2017-04-01T14:28:58.000Z","updated":"2017-05-24T10:05:21.000Z","comments":true,"path":"2017/04/01/0522_3/","link":"","permalink":"https://echotsai.github.io/2017/04/01/0522_3/","excerpt":"","text":"近期公司在和医疗智能硬件公司谈合作，想要把当前现有的病患、医生、医院和药店资源结合智能硬件商，做完整的行业解决方案。 我相信这已然是行业里的一个大趋势，通过运用医疗数据、行为数据、人群画像、风险数据，为用户的健康管理制定方案和提供依据。具体到产品上来说，即根据患者身体情况和疾病程度、历史产品使用记录服务的次数和效果、产生效果的人数等数据，逐步建立起数据模型，通过数据分析做出有针对性的健康管理建议。 于是，我对此做了一些需求的分析和功能逻辑的梳理： 同时，也针对慢病管理的个人版和医生版梳理了初步的功能规划脑图，因为脑图过大无法完整在这里展示，截图一小部分，完整版本可以点击 这里 查看。 未作展开的药店版因为要结合已经完成的版本，因此还没来得及完善；管理后台，需要根据客户端的功能来确定最终需求，也还没有具体展开；微信版只是用户版客户端的另一种呈现方式，很可能又少无多，所以没有过多展开。","categories":[{"name":"产品养成记","slug":"产品养成记","permalink":"https://echotsai.github.io/categories/产品养成记/"}],"tags":[{"name":"医疗","slug":"医疗","permalink":"https://echotsai.github.io/tags/医疗/"}]},{"title":"参加创客比赛的第一桶金","slug":"第三篇文章","date":"2016-09-20T15:58:58.000Z","updated":"2017-05-24T10:39:54.000Z","comments":true,"path":"2016/09/20/第三篇文章/","link":"","permalink":"https://echotsai.github.io/2016/09/20/第三篇文章/","excerpt":"","text":"赛前准备看过太多的创客，从未想过自己也会成为之一一直到2015年的夏天，报名参加了广州第二届创客马拉松参赛的我们有2名从未做过app的前端开发，1名设计师和1名“产品”（我）比赛的前1天，我还在否定自己无法胜任团队里的产品设计毕竟我当时连最基础的Axure还不会用，只会简单的手绘我自认为这样的组合，想拿奖是极其不容易的 关于比赛活动详情：点击查看官方报道大赛主题：围绕“智慧城市”和“开放数据”进行开发以改善城市开发时间：共48小时，从6月5号下午到6月7号下午比赛方式：6月7日下午交付作品demo，各团队做演讲展示作品评选方式：评委老师协商，选出前三名和单项奖并颁奖奖金设置：一等奖2万元奖金，单项奖5000元奖金现场评委：胡晓老师和几位投资人 确定作品主题比赛当天，我们提前下班搭地铁前往现场因为电脑不够用，谁会想到我们把公司的iMac搬到了现场 6月5日下午赶到现场的我们，从安顿好后开始讨论直到当天晚上7点，脑暴中的我们还毫无头绪，各种想法被一个个否定眼看时间已经逼近8点，48小时已经过去了6个小时我们没有继续犹豫不定，敲定了就做“餐饮界的优步”APP这个点子一共包括用户和商家两个角色，DEMO演示将重点放在用户版 分工非常明确，我负责手绘原型图设计师先行收集相关素材两位前端做前期准备毕竟他们从来做过app -作品实现-因为与平时的工作有别，所以我们对进度的把控地更为紧凑次日上午（6月6日），大家集体过了一遍我前一天晚上完成的初稿确定了需要修改的细节和基本方向没有问题 当天基本是流水线式作业我一页页地移交设计师敲定的原型稿设计师一页页地移交前端确定的设计稿1位前端负责设计稿的UI处理1位前端负责测试服务器的搭建和百度地图等难点完成主要功能的原型稿后，我开始做演示用的PPT设计师则在完成设计稿后，开始对PPT进行润色 当天晚上demo就完成得七七八八了剩下细节的优化、PPT、次日演示的demo设备调试 其实当天输出的手绘原型图略为粗糙，更多的是与设计师的频繁沟通因为合作默契，设计师的还原度和demo的还原度都非常高除了功能的实现和还原，APP两个端的命名、slogan等细节我们都以非常高效的方式达成了一致 原型草稿图：最终的成品： 作品展示比赛的最后一天，6月7日上午PPT的润色还在进行，我紧张地准备演讲稿两位前端们也紧张地准备着demo的演示设备 上台演示的顺序是抽签决定的，我们运气很好比较靠后下午2点左右，我们的作品也按时提交了全组四人都要登场，demo连接展示电视PPT投影到大屏幕，作品的主讲人是我，队友们帮助应对评委的提问 一切就绪后，第一组选手就开始上台展示作品了坐在台下的我们四个都边听边对比着自己的作品我们的大前端是两个男生，表面一点不紧张结果我练稿回来，竟然发现有一个boy紧张到手机摔碎了屏(╯﹏╰) 现场有20多个参赛团队，四位评委老师，100多人的样子终于到了我们组，我极力克制着紧张把产品演示完成队友们配合把手机demo拿给各位评委老师展示评委老师问了几个非常棘手的问题，我们也一一击破了作品展示终于告一段落，我们都长舒口气比赛竞争很激烈，现场也有很多优秀的作品我们不确定第一次参赛，能否拿到名次 赛事结果和颁奖晚上晚饭结束后，终于到了宣布结果的时候评委老师和投资人不紧不慢地报着获奖团队的名字三等奖有几名分别是xx团队、二等奖有几名分别是xx团队…听了很久都没听到自己的名字，我们四个人突然有点灰心 就在我们都不再抱什么希望的时候，出奇地听到了自己的队名“获得一等奖的团队是：Eater的作品！”“获得最佳商业价值奖同样是：Eater团队”压抑了太久的忐忑和不安瞬间转化成了爆发式的欢呼我们激动地欢呼抱在了一起，上台领取了奖状 获奖作品介绍所获奖项：一等奖 最具商业价值奖作品名称：Eater作品介绍：蹭饭 App是一款家常菜共享的App，主要解决上班族午饭问题，对于蹭饭用户而言，可上自取或者通过小区内的物流配送，从而实现地道家常菜的吃饭需求；对于在家做饭的阿姨们来说，在平日只给自己家做饭的同时还顺带获得额外收入，闲暇的劳动时间和精力被赋予经济价值。(点击可查看官方报道) PS：当时比较新鲜的创意，现在市场上已经有很多类似产品了比如“回家吃饭”。所以创意固然可贵，然而付诸行动才是最快而有效的实践方式。","categories":[{"name":"产品养成记","slug":"产品养成记","permalink":"https://echotsai.github.io/categories/产品养成记/"}],"tags":[{"name":"创客马拉松","slug":"创客马拉松","permalink":"https://echotsai.github.io/tags/创客马拉松/"}]},{"title":"复盘回顾从0到1的项目经历","slug":"0522_2","date":"2016-09-15T15:58:58.000Z","updated":"2017-05-26T15:12:25.000Z","comments":true,"path":"2016/09/15/0522_2/","link":"","permalink":"https://echotsai.github.io/2016/09/15/0522_2/","excerpt":"","text":"团队搭建和项目起步15年9月我加入了一个全新的团队当时团队的定位是要做O2O行业的第二个爱鲜蜂我作为第三个加入的早期成员真正体会了一次项目从0到1的发展 前期团队人数一直保持在10人左右，基本都是1个人干几个人的活儿。当时的人员配置相对精简，一些岗位尽量能省则省配置大概如下： 产品2人，兼顾项目管理、测试和应用发布等工作 设计1人，负责全部的UI设计和平面设计工作 运营3人，负责产品运营、市场运营和客服工作 客户端3人，iOS开发1人+安卓开发2人 后台3人，兼顾运维工作 初期个人成长我在团队里的角色是双向的一方面是产品策划，一方面是项目管理 团队新成员的磨合进度非常快9月底项目便开始进入正轨产品开始陆续进入开发 因为是初创团队，繁杂的事物就特别多各种开发账号、企业认证手续特别复杂企业认证和支付的事情本该是财务负责但是因为财务实在是一窍不通一头雾水为了加快日程进度我就索性一手负责了 这些工作很简单，却格外消耗一个人的耐心和精力，包括：阿里云服务器的认证，各种第三方平台的账号申请和认证：不限于苹果开发者账号、安卓各大市场注册认证、支付宝企业账号、微信企业账号、ping++企业账号、友盟、极光推送、融云sdk、mob sdk等等，对APP进行各大平台的发布上架 庆幸的是这些工作让我对认证和发布流程更了解而且稍微花点心思就不难发现他们的共同规律各类账号的企业认证和流程基本大同小异iOS和安卓的应用发布操作也很容易掌握因为本来没有这类多平台的操作说明文档我便自己梳理了一套以便提高工作效率： 第三方平台和应用市场说明：点击可查看笔记 短信平台极光推送流程：点击可查看笔记 设计和运营需求处理流程：点击可查看笔记 微信支付服务商检索设置：点击可查看笔记 APP上架应用市场注意事项：点击可查看笔记 产品策划通过不断的实践，主要在这些方面得到了成长：1. 原型图、流程图、思维导图等工具的使用 原型图：MockingBot、Axure、mockplus 流程图：visio、processon 思维脑图：百度脑图、XMind2. 市场调研、竞品分析、MRD、产品文档的撰写 市场调研问卷 竞品分析报告 用户反馈报告 MRD市场需求文档 产品需求文档 3. 各产品线的战略分析和分阶段的功能规划 O2O生活服务平台 O2O闪购配送服务 移动手机支付平台 4. web端、多个App和管理后台的设计 O2O生活服务平台：用户版、服务商、服务人员客户端和后台 O2O闪购配送服务：用户版、商家版客户端和后台 移动手机支付平台：用户版web、商家客户端、后台5. 针对用户数据做分析，对产品体验负责 对核心功能进行数据埋点、监测使用情况 针对不同场景和不同人群进行需求深度挖掘6. 熟悉开发全流程，学习产品生命周期的管理 实践产品从0到1的设计、评审、开发、测试、上线、迭代7. 对用户反馈负责，持续改善产品 对市场运营人员进行新产品培训 通过客服和市场人员收集用户反馈，每周更新需求池 通过用户体验需求评审会，有针对性地进行功能迭代 项目管理项目管理方面的个人提升，令我成长了更多相比之下，它更考验一个人的号召力和应变能力通过实践，倒逼我学习了项目管理的专业知识重点解决了项目中的以下问题： 产品发布流程不规范，导致产品上线延误 产品上线前，产品内部培训不到位 产品上线后出现可控性问题，影响用户体验 跨部门沟通不到位，各部门产生分歧影响进度 产品内部分工不平衡，导致进度瓶颈 运营活动方案实现流程混乱，效率低下 市场部门需求提交流程不规范，导致实现进度慢 产品测试不到位，测试用例评审不到位 产品需求变动频繁，导致项目进度受阻 其中成效最明显的是产品发布流程的梳理，这里选放一段优化后的APP发版流程：点击可查看笔记另外，项目管理专业知识方面暂不做过多展开对项目管理工具的掌握，对项目发展帮助明显： 日程图： Q&amp;A表： 甘特图： 项目发展在大家的共同努力下，发展业务发展态势良好业务线也有所增加，在原来的O2O生活服务平台基础上，新增了移动支付业务 于是团队迅速进行了人员的扩充，扩充后的配置如下：产品4人，设计3人，产品运营3人，客户端6人，后台10人，前端3人，测试3人，运维1人，商务2人，客服2人，市场运营人员10+ 我对这段发展经历，做了一个简单的梳理： 项目成果经过团队不断地磨合和调整，产品从引入期进入了发展期，并获得新一轮的融资。两条业务线都取得的成绩如下： O2O生活服务平台：产品自2016年1月上线，用户量从0增长到24万+，引进商家3000+，峰值日订单量8w+，总流水200余万+ 移动支付业务：产品自2016年10月上线，用户量从0增长到10万+，入驻商户5000+，累计流水2000万+ 项目终结非常遗憾的，就在大家都期待着融资到账之际O2O行业遭遇了一场资本寒冬，投资方没有兑现承诺公司因为资金问题，项目告终并解散了团队在我离开之际，产品部已经从4人减至1人于是我对一直以来的工作做了认真的梳理： 回想起和队友们并肩作战的日子，内心百感交集眼前，突然浮现出程序员们凌晨4点改完bug的喜悦仿佛又看到评审会上，为了一个小功能而争辩得面红耳赤隐约又听到管理例会上，部门负责人关于未来的激昂讨论 创业本就是一场狂欢与冒险，即便失败也不足以被其打败我相信，很快每个人都会走出悲伤为成为更好的自己而加倍努力fighting！","categories":[{"name":"产品养成记","slug":"产品养成记","permalink":"https://echotsai.github.io/categories/产品养成记/"}],"tags":[{"name":"项目管理  流程优化  甘特图","slug":"项目管理-流程优化-甘特图","permalink":"https://echotsai.github.io/tags/项目管理-流程优化-甘特图/"}]},{"title":"我的第一篇博客","slug":"hello-world","date":"2016-01-15T15:58:58.000Z","updated":"2017-05-26T10:15:38.000Z","comments":true,"path":"2016/01/15/hello-world/","link":"","permalink":"https://echotsai.github.io/2016/01/15/hello-world/","excerpt":"","text":"初次接触博客拖延了这么久，终于用hexo的框架搭好了自己的博客看了一圈儿别人的酷炫博客，感觉自己像在一个茅房里码字吓得我赶紧去搬了几块砖，结果砖头样式太多，把自己看花了眼貌美如花的个人博客多到没朋友，我就直接搬过来慢慢挑了： 酷炫吊炸天：立体世界-Maxodgen哥动感摇摆-第5维度™工作室一直会自己动的代码对话-strml.net实时记录-动态齿轮 深藏功与名：走遍全球游记哥-翁天信 · Dandy Weng 黑白灰性冷淡：印刷店既视感故事型展开-黑加白水墨画游记-分分钟成仙 纯技术最简风：技术博客-于江水 新概念英语风格：Rafal Tomal BEC商务英语既视感：EVANYOU 暂时先更这么多吧，毕竟外貌不是最重要的。[引自]你见过的最棒的个人博客界面是什么样的？ 博客风格替换兜了一圈儿，才猛然发现原来hexo有现成的theme没文化真可怕，明明官网theme的入口显眼得很：https://hexo.io/themes/果然还没适应过来程序员的世界，总是容易忽略文档这回终于记得了，选好theme后就乖乖看起了文档markdown语法还不是很熟悉，所以临摹了一段文档（标题小了1个尺寸） Installation 123456# change to work dircd /your_blog_dir/# install dependenciesnpm i -S hexo-generator-search hexo-generator-feed hexo-renderer-less hexo-autoprefixer hexo-generator-json-content# download sourcegit clone https://github.com/stkevintan/hexo-theme-material-flow themes/material-flow Configuration Change the value of theme to material-flow in _config.yml. Put your avatar &amp;&amp; favicon images to source/images/. Edit _config.yml and themes/material-flow/_config.yml for your needs. Here are some examples: _config.yml themes/material-flow/_config.yml","categories":[{"name":"从零学编程","slug":"从零学编程","permalink":"https://echotsai.github.io/categories/从零学编程/"}],"tags":[{"name":"markdown","slug":"markdown","permalink":"https://echotsai.github.io/tags/markdown/"}]}]}